zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32BG29/Include/efr32bg29_etampdet.h
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy59                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy59 << 0) /**< Shifted mode DivideBy59 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy60                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy60 << 0) /**< Shifted mode DivideBy60 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy61                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy61 << 0) /**< Shifted mode DivideBy61 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy62                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy62 << 0) /**< Shifted mode DivideBy62 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy63                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy63 << 0) /**< Shifted mode DivideBy63 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy64                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy64 << 0) /**< Shifted mode DivideBy64 for ETAMPDET_CLKPRESCVAL*/
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_SHIFT                                    8                                                  /**< Shift value for ETAMPDET_UPPERPRESC         */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_MASK                                     0x700UL                                            /**< Bit mask for ETAMPDET_UPPERPRESC            */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_DEFAULT                                  0x00000000UL                                       /**< Mode DEFAULT for ETAMPDET_CLKPRESCVAL       */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_Bypass                                   0x00000000UL                                       /**< Mode Bypass for ETAMPDET_CLKPRESCVAL        */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy2                                0x00000001UL                                       /**< Mode DivideBy2 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy4                                0x00000002UL                                       /**< Mode DivideBy4 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy8                                0x00000003UL                                       /**< Mode DivideBy8 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy16                               0x00000004UL                                       /**< Mode DivideBy16 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy32                               0x00000005UL                                       /**< Mode DivideBy32 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy64                               0x00000006UL                                       /**< Mode DivideBy64 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_UPPERPRESC_Reserved                                 0x00000007UL                                       /**< Mode Reserved for ETAMPDET_CLKPRESCVAL      */
#define ETAMPDET_CLKPRESCVAL_UPPERPRESC_DEFAULT                                   (_ETAMPDET_CLKPRESCVAL_UPPERPRESC_DEFAULT << 8)    /**< Shifted mode DEFAULT for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_UPPERPRESC_Bypass                                    (_ETAMPDET_CLKPRESCVAL_UPPERPRESC_Bypass << 8)     /**< Shifted mode Bypass for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy2                                 (_ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy2 << 8)  /**< Shifted mode DivideBy2 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy4                                 (_ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy4 << 8)  /**< Shifted mode DivideBy4 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy8                                 (_ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy8 << 8)  /**< Shifted mode DivideBy8 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy16                                (_ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy16 << 8) /**< Shifted mode DivideBy16 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy32                                (_ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy32 << 8) /**< Shifted mode DivideBy32 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy64                                (_ETAMPDET_CLKPRESCVAL_UPPERPRESC_DivideBy64 << 8) /**< Shifted mode DivideBy64 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_UPPERPRESC_Reserved                                  (_ETAMPDET_CLKPRESCVAL_UPPERPRESC_Reserved << 8)   /**< Shifted mode Reserved for ETAMPDET_CLKPRESCVAL*/

/* Bit fields for ETAMPDET LOCK */
#define _ETAMPDET_LOCK_RESETVALUE                                                 0x0000AEE8UL                          /**< Default value for ETAMPDET_LOCK             */
#define _ETAMPDET_LOCK_MASK                                                       0x0000FFFFUL                          /**< Mask for ETAMPDET_LOCK                      */
#define _ETAMPDET_LOCK_LOCKKEY_SHIFT                                              0                                     /**< Shift value for ETAMPDET_LOCKKEY            */
#define _ETAMPDET_LOCK_LOCKKEY_MASK                                               0xFFFFUL                              /**< Bit mask for ETAMPDET_LOCKKEY               */
#define _ETAMPDET_LOCK_LOCKKEY_DEFAULT                                            0x0000AEE8UL                          /**< Mode DEFAULT for ETAMPDET_LOCK              */
#define _ETAMPDET_LOCK_LOCKKEY_UNLOCK                                             0x0000AEE8UL                          /**< Mode UNLOCK for ETAMPDET_LOCK               */
#define ETAMPDET_LOCK_LOCKKEY_DEFAULT                                             (_ETAMPDET_LOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_LOCK      */
#define ETAMPDET_LOCK_LOCKKEY_UNLOCK                                              (_ETAMPDET_LOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ETAMPDET_LOCK       */

/** @} End of group EFR32BG29_ETAMPDET_BitFields */
/** @} End of group EFR32BG29_ETAMPDET */
/** @} End of group Parts */

#endif // EFR32BG29_ETAMPDET_H
